{
  "main": {
    "name": "Deepak Singh",
    "occupation": "McGill Computer Science Student",
    "description": "Welcome to my personal website!",
    "image": "profilepic2.png",
    "bio2": "Hi! I am a fourth year Computer Science student studying at McGill University. I started programming at the age of 16 but never really saw its true potential until the age of 19. After a year of university in Finance, I saw technology as a tool that can positively impact our society which motivated me to change majors and go into Computer Science.",
    "bio": "Hi! I am a fourth year Computer Science student studying at McGill University. I recently finished a summer internship at Intact Financial Corporation where I worked as a software engineering intern supporting the development of artificial intelligence tools. I believe software and technology can be used to do positive contributions towards our society and environment. This motivates me to continuously learn new things!",
    "hobbies": "When I am not programming, you can find me bouldering or biking around Montreal!",
    "contactmessage": "Here is where you should write your message to readers to have them get in contact with you.",
    "email": "deepakanhviet@gmail.com",
    "phone": "438-391-7446",
    "address": {
      "street": "(Your Street)",
      "city": "Montreal",
      "state": "Quebec",
      "zip": "(Your Zip/Postal Code)"
    },
    "website": "http://www.timbakerdev.com",
    "resumedownload": "DeepakSinghResumeMaster.pdf",
    "social": [
      {
        "name": "linkedin",
        "url": "https://www.linkedin.com/in/deepok101/",
        "className": "fa fa-linkedin"
      },
      {
        "name": "github",
        "url": "http://github.com/Deepok101",
        "className": "fa fa-github"
      }
    ]
  },
  "resume": {
    "skillmessage": "Here you can create a short write-up of your skills to show off to employers",
    "education": [
      {
        "school": "McGill University",
        "degree": "Bachelor of Arts",
        "major": "Computer Science",
        "graduated": "August 2018 - December 2021",
        "gpa": "3.96 / 4.00",
        "awards": "Dean's Honour List",
        "relatedCoursework": "Data Structures and Algorithms, Database Systems, Machine Learning, Software Design",
        "description": "Describe your experience at school, what you learned, what useful skills you have acquired etc.",
        "logo": "mcgilllogo.png"
      }
    ],
    "work": [
      {
        "company": "Intact Financial Corporation",
        "title": "Software Engineering Intern",
        "years": "May 2021 - August 2021",
        "description": [
          "Built an automated machine learning training stage for NLP projects, improving iterative model training by 30%.",
          "Developed a Gitlab pipeline allowing users to modify their NLP project dataset with pre-labeled data, used by 2 data science teams.",
          "Designed and implemented an automatic recovery system that recovers version-controlled datasets during failures.",
          "Added 80% unit test code coverage to an internal application that centralizes the components of NLP pipelines."
        ],
        "logo": "intactlogo.png"
      },
      {
        "company": "Coveo Solutions",
        "title": "Software Developer Intern",
        "years": "May 2020 - August 2020",
        "description": [
          "Created an automatic OAuth secret rotation mechanism for a microservice, reducing the server load by 3 API calls per user input.",
          "Wrote 12 end-to-end Selenium tests for a front-end product, preventing broken changes from being launched.",
          "Built a Quickview component in Typescript that allows users to preview PDF, Excel, Word, and HTML documents."
        ],
        "logo": "coveologo.png"
      },
      {
        "company": "DeepEmploi",
        "title": "Software Developer Intern",
        "years": "May 2020 - August 2020",
        "description": [
          "Created a MySQL database and Flask server to manage the daily flow of client data, decreasing company account receivables by $40,000.",
          "Built an application that uses handwriting recognition to extract the data of over 5000 physical employee worksheets.",
          "Improved invoice validation efficiency by 50% by creating a React user interface for unpaid invoice data.",
          "Deployed Python workflow automations to streamline employee dispatching, reducing manual work by 40%."
        ],
        "logo": "deepemploilogo.png"
      }

    ],
    "skills": [
      {
        "name": "Git",
        "level": "60%"
      },
      {
        "name": "Illustrator",
        "level": "55%"
      },
      {
        "name": "ReactJs",
        "level": "50%"
      },
      {
        "name": "CSS",
        "level": "90%"
      },
      {
        "name": "HTML5",
        "level": "80%"
      },
      {
        "name": "VueJs",
        "level": "50%"
      },
      {
        "name": "MongoDB",
        "level": "80%"
      }
    ]
  },
  "portfolio": {
    "projects": [
      {
        "title": "Colt Express",
        "category": "My Travel Blog for my post-university travels",
        "image": "coltexpress.jpg",
        "url": "https://github.com/Deepok101/ColtExpressExec/releases/tag/1.0",
        "description": [
          "(Server is offline)",
          "Led a team of 5 developers to create the Colt Express board game on Mac and Windows with the Unity engine.", 
          "Developed a RESTful API with Node.js and Express to manage the states of multiple concurrent games.", 
          "Implemented a multiplayer feature that allows up to 6 players to play against each other from separate devices.",
          "Leveraged a MongoDB database to store the progress of ongoing games, allowing users to save and load games."
        ],
        "stack": ["Unity", "C#", "Typescript", "Node.js", "Express"]
      },
      {
        "title": "Resume Match",
        "category": "(offline now) A fighting gear company I started",
        "image": "ResumeMatch.png",
        "url": "https://github.com/Deepok101/ResumeMatch",
        "description": [
          "Collaborated with 4 developers to create a web application that matches resumes to active software job postings.",
          "Built a Python web scraper that fetches job posting information from 2 sources.",
          "Utilized a PostgreSQL database to store the data of 10000 job postings.",
          "Developed an algorithm that scores a user’s resume to a job posting based on the job’s technical requirements."
        ],
        "stack": ["Golang", "Python", "Docker"]
      },
      {
        "title": "Coderunners",
        "category": "Website I built for a restaurant I like in Thailand",
        "image": "coderunners.png",
        "url": "https://github.com/Deepok101/coderunners",
        "description": [
          "Developed a RESTful API with Golang that allows users to run and debug code through HTTP requests.",
          "Created a Python debugger with step-in, step-out and step-over functionalities.",
          "Utilized Docker to containerize the execution and debugging of code."
        ],
        "stack": ["Golang", "Python", "Docker"]
      },
      {
        "title": "TruckersFifthWheel",
        "category": "Website I built for a restaurant I like in Thailand",
        "image": "TruckersFifthWheel.png",
        "url": "http://www.timbakerdev.com/originalthaifood.github.io",
        "description": [
          "Created a social media web application allowing individuals in the transportation industry to connect.",
          "Developed the following features: authentication, creating/liking posts, creating/liking comments, posting/applying jobs, and customizable profiles.",
          "Leveraged Socket.io to allow real time website updates."
        ],
        "stack": ["Javascript", "React", "MongoDB", "Socket.io"]
      }
    ]
  },
  "testimonials": {
    "testimonials": [
      {
        "text": "Here you should write some nice things that someone has said about you. No lies though, employers can tell when you are lying.",
        "user": "Kareem Abdul Jabbar"
      },
      {
        "text": "That Tim Baker must be one of the most brilliant developers I've ever met! It is amazing that nobody has hired him yet. Hey you, you should hire this guy, he may be fresh out of University and have zero on the job experience but I am confident that he will be one of your best developers in no time!",
        "user": "Steve Wozniak... impersonator"
      }
    ]
  }
}
